//基本元素，所有APP可能都会用到的
"Yes" = "Yes";
"No" = "No";
"OK" = "OK";
"Cancel" = "Cancel";
"Close" = "Close";

//APP配置信息
"AreaIndex"= "0";
"About" = "About";
"Appname" = "WiseVPN";
"CopyRight" = "Copyright ©2016 wisevpn.net";
"Appname2" = "ShadowVPN";
"CopyRight2" = "Copyright ©2016 66mob.com";
"APPSTOREURL" = "http://itunes.apple.com/us/app/id%@?mt=8";
"REVIEWURL" = "itms-apps://ax.itunes.apple.com/WebObjects/MZStore.woa/wa/viewContentsUserReviews?type=Purple+Software&id=%@";

//下面是功能模块
//更多
"More" = "More";
"More Apps" = "More Apps";
"Submit Review" = "Submit Review";
"Email to a Friend" = "Share to  Friend";
"Check for Update" = "Check for Update";
"Feedback" = "Feedback";
"Help" = "Help";
"About" = "About";
"This device is not configured to send e-mail function." = "This device is not configured to send e-mail function.";
"Recommend a good application to you" = "Recommend a good application to you";
"I found a good application to automatic" = "I found a good application named %@. Regularly recommended to you. Download address is:\r\n\r\n";
"Mail has been canceled." = "Mail has been canceled.";
"Message is saved." = "Message is saved.";
"Message has been sent." = "Message has been sent.";
"Message failed to send." = "Message failed to send.";
"Message was not sent." = "Message was not sent.";
"Suggest" = "Suggest about %@ %@";
"More feture" = "More feture";
"Setting" = "Setting";
"Upgrade to pro version ." = "Upgrade to pro version";
"Restore Purchases" = "Restore Purchases";
"You will upgrade to the pro version and remove all limits." = "You will upgrade to the pro version and remove all limits.";
"Continue" = "Continue";
"processing" = "processing";
"Thanks" = "Thanks";
"Thanks for your support!" = "Thanks for your support!";
"Tips" = "Tips";
"Opening..." = "Opening...";
"Install" = "Install";
"%@ - available on the App Store" = "%@ - available on the App Store";
"Free" = "Free";
"Professional" = "Professional";
"APP Theme" = "APP Theme";
"Follow on Twitter" = "Follow on Twitter";
//下面根据情况具体对待

//MainViewController
"Home" = "Home";
"Tools" = "Tools";
"Auto select and order by speed" = "Auto select and order by speed";

//HomeViewController
"WiseVPN" = "WiseVPN";
"Connect" = "Connect";
"Invalid. Waiting for setting." = "Invalid. Waiting for setting.";
"Disconnected" = "Disconnected";
"Disconnecting" = "Disconnecting";
"Connecting" = "Connecting";
"Reasserting" = "Reasserting";
"Connected" = "Connected";
"Disconnect" = "Disconnect";
"Proxy Server :    None" = "Proxy Server :    None";
"Proxy Server" = "Proxy Server";
"Settings" = "Settings";
"Mode :" = "Mode :";
"Auto" = "Auto";
"Global" = "Global";
"You have choices another server. To be using the new server. You must disconnected from current server." = "You have choices another server. To be using the new server. You must disconnected from current server.";
"QR Read" = "QR Read";
"Found a new Share account. Add it?" = "Found a new Share account. Add it?";
"Added suc!" = "Added suc!";
"Added suc!\nExpiration Date : %@" = "Added suc!\nExpiration Date : %@";
"Local proxy for develop" = "Local proxy for develop";
"Proxy Server :    %@ %@" = "Proxy Server :    %@ %@";
"DNS :    System" = "DNS :    System";
"System" = "System";
"From share" = "From share";
"Regulation" = "Regulation";
"From Album" = "From Album";
"The proxy has expired." = "The proxy has expired.";
"Share Now" = "Share Now";

//ServerList
"Local" = "Local";
"Remote" = "Remote";
"Are you sure to remove select item from list?" = "Are you sure to remove select item from list?";
"Confirm?" = "Confirm?";
"Proxy Server" = "Proxy Server";
"Type" = "Type";
"Name" = "Name";
"Given Name" = "Given Name";
"Server" = "Server";
"Server Address" = "Server Address";
"Port" = "Port";
"Server Port" = "Server Port";
"Password" = "Password";
"Server Password" = "Server Password";
"Auth Method" = "Auth Method";
"SSR Parameters" = "SSR Parameters";
"Errors" = "Errors";
"Add or update fail! Try again later." = "Add or update fail! Try again later.";
"Add or update fail! Uninstall your app and reinstall again. And try again later." = "Add or update fail! Uninstall your app and reinstall again. And try again later.";
"Remote Server" = "Remote Server";
"Add Proxy Server" = "Add Proxy Server";
"Only for Http/Https" = "Only for Http/Https";
"Need Auth" = "Need Auth";
"Username" = "Username";

//Share to friends
"Share to friends" = "Share to friends";

"Share to" = "Share to";
"Save to album" = "Save to album";
"Save fail!" = "Save fail!";
"Saved suc!" = "Saved suc!";
"%@ Proxy Share" = "%@ Proxy Share";
"Invalid date!" = "Invalid date!";
"Expiration Date" = "Expiration Date";

//DNS Mgr
"Custom DNS" = "Custom DNS";
"Invalid IP" = "Invalid IP";
"DNS List" = "DNS List";

//Dev log
"Request detail" = "Request detail";
"Recent requests" = "Recent requests";
"No Contents" = "No Contents";
"Proxy server works fine. \nNow open your website or App you want to debug." = "Proxy server works fine. \nNow open your website or App you want to debug.";
"You should connect to proxy server before view request log." = "You should connect to proxy server before view request log.";
"Open Safari" = "Open Safari";
"Connect To Proxy Server" = "Connect To Proxy Server";
"Request begin" = "Request begin";
"Request end" = "Request end";
"URL Match start" = "URL Match start";
"URL Match end" = "URL Match end";
"IP Match start" = "IP Match start";
"IP Match end" = "IP Match end";
"DNS Match start" = "DNS Match start";
"DNS Match end" = "DNS Match end";
"DNS lookup start" = "DNS lookup start";
"DNS lookup fail" = "DNS lookup fail";
"DNS lookup end" = "DNS lookup end";
"Remote connect start" = "Remote connect start";
"Remote connected" = "Remote connected";
"Global mode" = "Global mode";
"None Global mode" = "None Global mode";
"Proxy DNS lookup start" = "Proxy DNS lookup start";
"Proxy DNS lookup fail" = "Proxy DNS lookup fail";
"Proxy DNS lookup end" = "Proxy DNS lookup end";
"Proxy start" = "Proxy start";
"Proxy connected" ="Proxy connected";
"IP V6" = "IP V6";

//running log
"Running log" = "Running log";

//Tools
"Log" = "Log";
"Recent requests log" = "Recent requests log";
"My IP location" = "My IP location";
"Status" = "Status";
"Starting time: %@" = "Starting time: %@";
"Running time: %@" = "Running time: %@";
"Ping Test" = "Ping Test";

//rule
"Auto match" = "Auto match";
"Block ads" = "Block ads";
"Direct all CN website" = "Direct all CN website";
"Proxy all US website" = "Proxy all US website";
"Proxy all JP website" = "Proxy all JP website";
"Rule :    %@" = "Rule :    %@";
"Default" = "Default";
"Custom" = "Custom";
"Custom rule set" = "Custom rule set";
"User rule set has been exist!" = "User rule set has been exist!";
"Start WiFi server..." = "Start WiFi web server...";
"Edit rule set from Mac/PC" = "Edit rule set from Mac/PC";
"Open your computer's web browser with the following URL：\r\n%@" = "Open your computer's web browser with the following URL：\r\n%@";
"You need wifi environment in order to use the wifi rule set manage." = "You need wifi environment in order to use the wifi rule set manage.";

//网速测试
"Net Speed Test" = "Net Speed Test";
"File url" = "File url";
"File to download" = "File to download";
"Avg speed : %@" = "Avg speed : %@";
"Start" = "Start";
"Stop" = "Stop";

//VIP
"waiting..." = "waiting...";
"Something went wrong. Maybe you have ordered another package." = "Something went wrong. Maybe you have ordered another package.";
"Thank you! Please restart app after buying if invalid date not update." = "Thank you! Please restart app after buying if invalid date not update.";
"Thank you! Please restart app and wait a moment after subscriptions if expiration date not update." = "Thank you! Please restart app and wait a moment after subscriptions if expiration date not update.";
